"""
У вас є текстовий файл, який містить інформацію про котів. Кожен рядок файлу містить унікальний ідентифікатор
кота, його ім'я та вік, розділені комою.

Наприклад:

60b90c1c13067a15887e1ae1,Tayson,3
60b90c2413067a15887e1ae2,Vika,1
60b90c2e13067a15887e1ae3,Barsik,2
60b90c3b13067a15887e1ae4,Simon,12
60b90c4613067a15887e1ae5,Tessi,5

Ваше завдання - розробити функцію get_cats_info(path), яка читає цей файл та повертає список 
словників з інформацією про кожного кота.

Вимоги до завдання:

Функція get_cats_info(path) має приймати один аргумент - шлях до текстового файлу (path).
Файл містить дані про котів, де кожен запис містить унікальний ідентифікатор, ім'я кота та його вік.
Функція має повертати список словників, де кожен словник містить інформацію про одного кота.

Рекомендації для виконання:

Використовуйте with для безпечного читання файлу.
Пам'ятайте про встановлення кодування при відкриті файлів
Для кожного рядка в файлі використовуйте split(',') для отримання ідентифікатора, імені та віку кота.
Утворіть словник з ключами "id", "name", "age" для кожного кота та додайте його до списку, який буде повернуто.
Опрацьовуйте можливі винятки, пов'язані з читанням файлу.

Критерії оцінювання:
Функція має точно обробляти дані та повертати правильний список словників.
Повинна бути належна обробка винятків і помилок.
Код має бути чистим, добре структурованим і зрозумілим.
"""

import os

path = r'C:\PythonProject\PythonCoreCourse\cats.txt'
# path = r"path/to/cats_file.txt"


def get_cats_info(path):
    # обробка випадку якшо файла не існує або шлях вказан не вірно
    if not os.path.exists(path):
        print("Файл не існує або шлях до нього вказан невірно")

    # створимо змінні для зберігання питомої інформаціх і шаблон для побудови словників  по котам
    cats_list = []
    cat_info = ['id', 'name', 'age']
    # обробка випадку коли файл не вдалося прочитати, або помилка в форматі запису
    try:
        with open(path, 'r', encoding='utf-8') as file:
            for line in file:
                # приберемо зайві пробіли та символ переноса строки, та розібьемо файл по комах
                cat_item = line.strip().split(',')
                # змінна для побудови словника по конкретному коту
                cat_dict = {}
                # пройдемось по кожному конкретному коту і створимо на нього словник
                for num, cat in enumerate(cat_item):
                    cat_dict[cat_info[num]] = cat
                # додамо словник до списку результату функції
                cats_list.append(cat_dict)
    except:
        print('Нажаль файл пошкоджено, або його формат не підтримується')

    return cats_list


if __name__ == '__main__':

    # перевірка роботи функції
    cats_info = get_cats_info(path)
    print(cats_info)
