"""
У вас є текстовий файл, який містить інформацію про місячні заробітні плати розробників у вашій компанії.
Кожен рядок у файлі містить прізвище розробника та його заробітну плату, які розділені комою без пробілів.

Наприклад:

Alex Korp,3000
Nikita Borisenko,2000
Sitarama Raju,1000

Ваше завдання - розробити функцію total_salary(path), яка аналізує цей файл і повертає загальну
та середню суму заробітної плати всіх розробників.

Вимоги до завдання:

Функція total_salary(path) має приймати один аргумент - шлях до текстового файлу (path).
Файл містить дані про заробітні плати розробників, розділені комами. Кожен рядок вказує на одного розробника.
Функція повинна аналізувати файл, обчислювати загальну та середню суму заробітної плати.
Результатом роботи функції є кортеж із двох чисел: загальної суми зарплат і середньої заробітної плати.

Рекомендації для виконання:

Використовуйте менеджер контексту with для читання файлів.
Пам'ятайте про встановлення кодування при відкриті файлів
Для розділення даних у кожному рядку можна застосувати метод split(',').
Обрахуйте загальну суму заробітної плати, а потім розділіть її на кількість розробників, щоб отримати середню зарплату.
Опрацьовуйте можливі винятки при роботі з файлами, такі як відсутність файлу.

Критерії оцінювання:

Функція повинна точно обчислювати загальну та середню суми.
Повинна бути обробка випадків, коли файл відсутній або пошкоджений.
Код має бути чистим, добре структурованим і зрозумілим.
"""
import os
path = r'C:\PythonProject\PythonCoreCourse\salary.txt'
# path = r"path/to/salary_file.txt"


def total_salary(path):
    if not os.path.exists(path):
        print("Файл не існує або шлях до нього вказан невірно")
        # повернемо кортеж щоб не викликати помилку невідповідності  при виклику функції в разі помилки шляху
        return None, None
    # про всяк випадок будемо рахувати зп в float форматі і переьворення робить в ньогож
    salary_total = 0.0
    # лічильник для розрахунку середньох ЗП
    count = 0
    # обробка випадку коли файл не вдалося прочитати, або помилка в форматі запису
    try:
        with open(path, 'r', encoding='utf-8') as file:
            for line in file:
                salary_total += float(line.split(',')[1])
                count += 1
    except:
        print('Нажаль файл пошкоджено, або його формат не підтримується')
    # обробка випадку коли файл порожній
    try:
        salary_avg = salary_total / count
    except ZeroDivisionError as div:
        print(div)
    return salary_total, salary_avg


if __name__ == '__main__':
    total, average = total_salary(path)
    print(f"Загальна сума заробітної плати: {total}, Середня заробітна плата: {average}")
